In [1]:
import numpy as np
import pandas as pd

#### iloc = integer location
dataframe.iloc[row_index,column_index]

In [2]:
#np arrays
random = np.random.randint(low = 0, high =100, size = 20)
name = np.random.choice(['A', 'B', 'C', 'D', 'E'],size =  20)
choice = np.random.choice([10,11,13,12,14],size = 20)

#creating dictionary
dict1 = {
    'Random':random, 
    'Name':name,
    'Choice':choice
}

#creating dataframe
df = pd.DataFrame(dict1)
df

    Random Name  Choice
0       33    D      14
1       56    B      13
2       73    B      11
3       78    B      10
4       22    C      13
5       85    E      11
6       22    C      12
7       22    D      14
8       58    E      11
9       59    C      12
10      61    B      13
11      66    A      11
12      51    E      10
13      67    E      10
14      32    A      11
15       8    B      12
16      75    B      13
17       6    E      14
18      91    A      10
19      43    B      11

In [3]:
# to access the first element in Random Column
df.iloc[0,0]

33

In [4]:
# to access the 5th element in Choice Column
df.iloc[4,2]

13

In [5]:
# to access the 11th element in the name column
df.iloc[10,1]

'B'

In [6]:
# similarly you can do the slicing here as well

# to get first 5 rows 
df.iloc[:5,:]

   Random Name  Choice
0      33    D      14
1      56    B      13
2      73    B      11
3      78    B      10
4      22    C      13

In [7]:
# to get first 10 rows and first 2 columns
  #start:stop:step
    
df.iloc[:10,:2]

   Random Name
0      33    D
1      56    B
2      73    B
3      78    B
4      22    C
5      85    E
6      22    C
7      22    D
8      58    E
9      59    C

#### loc = location

In [8]:
marks_df = pd.read_csv('marks.csv')
marks_df

  Name  Physics  Chemistry  Maths  Biology
0    A       65         69     87       90
1    B       44         76     57       80
2    C       57         85     79       75
3    D       54         66     71       70
4    E       74         86     75       88
5    F       64         67     77       81

In [9]:
marks_df.set_index('Name',inplace = True)

In [10]:
marks_df

      Physics  Chemistry  Maths  Biology
Name
A          65         69     87       90
B          44         76     57       80
C          57         85     79       75
D          54         66     71       70
E          74         86     75       88
F          64         67     77       81

In [11]:
# to get the Ath values
marks_df.loc["A"]

Physics      65
Chemistry    69
Maths        87
Biology      90
Name: A, dtype: int64

In [12]:
# to get multiple rows 
marks_df.loc[["A","C","E"]]

      Physics  Chemistry  Maths  Biology
Name
A          65         69     87       90
C          57         85     79       75
E          74         86     75       88

In [13]:
# to get the only physics and chemistry
marks_df.loc[:,["Physics","Chemistry"]]

      Physics  Chemistry
Name
A          65         69
B          44         76
C          57         85
D          54         66
E          74         86
F          64         67

### Concatination
syntax ---- > 
* pd.concat([dataframe1,dataframe2],axis = 0) for row-wise
* pd.concat([dataframe1,dataframe2],axis = 1) for column-wise

In [14]:
#creating dictionary
dict1 = {
    'Letter':['a','b'],
    'Number':[1,2]
}

#creating dataframe1
d1 = pd.DataFrame(dict1)
d1

  Letter  Number
0      a       1
1      b       2

In [15]:
#creating dict2
dict2 = {
    'Letter':['c','d'],
    'Number':[3,4],
    'Animal':['lion','tiger']
}

#creating dataframe2
d2 = pd.DataFrame(dict2)
d2

  Letter  Number Animal
0      c       3   lion
1      d       4  tiger

#### Row-wise / Vertical concatination
* In simple terms we are placing 2 dataframes one below the others

In [16]:
pd.concat([d1,d2], axis =0)

  Letter  Number Animal
0      a       1    NaN
1      b       2    NaN
0      c       3   lion
1      d       4  tiger

In [17]:
# to get the indexes in order
pd.concat([d1,d2], axis =0, ignore_index=True)

  Letter  Number Animal
0      a       1    NaN
1      b       2    NaN
2      c       3   lion
3      d       4  tiger

#### Column-wise / Horizontal Concatination
* In simple terms we are placing the 2 dataframes side by side

In [18]:
pd.concat([d1,d2], axis = 1)

  Letter  Number Letter  Number Animal
0      a       1      c       3   lion
1      b       2      d       4  tiger

### Merging
* syntax ---- > pd.merge(dataframe1,dataframe2, on='YourColumnName')

In [19]:
dict1 = {
    "city" : ["A","B","C","D","E"],
    "temperature" : [32,33,34,35,36]
}

df1 = pd.DataFrame(dict1)
df1

  city  temperature
0    A           32
1    B           33
2    C           34
3    D           35
4    E           36

In [20]:
dict2 = {
    "city" : ["C","D","E","F","G"],
    "humidity" : [65,66,67,68,69]
}

df2 = pd.DataFrame(dict2)
df2

  city  humidity
0    C        65
1    D        66
2    E        67
3    F        68
4    G        69

In [21]:
df = pd.merge(df1,df2, on='city')
df
# observe by default it is performing inner join

  city  temperature  humidity
0    C           34        65
1    D           35        66
2    E           36        67

In [22]:
pd.merge(df1,df2, on='city', how ='outer')

  city  temperature  humidity
0    A         32.0       NaN
1    B         33.0       NaN
2    C         34.0      65.0
3    D         35.0      66.0
4    E         36.0      67.0
5    F          NaN      68.0
6    G          NaN      69.0

### Some Preprocessing techinques

In [23]:
data = pd.Series([0, 1, 2, 3, 4, 5,np.nan, 6, 7, 8])
data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    NaN
7    6.0
8    7.0
9    8.0
dtype: float64

In [24]:
#to detect missing values
data.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [25]:
# Detect existing (non-missing) values.
data.notnull()

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7     True
8     True
9     True
dtype: bool

In [26]:
# creating a dataframe
dict1 = {
    0:[1,4,7,np.nan],
    1:[2,5,np.nan,np.nan],
    2:[3,np.nan,np.nan,np.nan],
    3:[np.nan,np.nan,np.nan,np.nan]
}

df = pd.DataFrame(dict1)
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [27]:
#drops an entire row if one nan value is present
df.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [28]:
# deletes the rows in which all the values are null
df.dropna(how='all')

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [29]:
# deletes the columns in which all the values are null
df.dropna(how='all',axis = 1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [30]:
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [31]:
# threshold Require that many 'non-nan' values.
df.dropna(thresh=1)

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [32]:
df.dropna(thresh=1,axis = 1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [33]:
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

#### Filling the null values
* syntax --- > **df.fillna(val)**
* returns a new DataFrame

In [34]:
df_fill = df.fillna(0)
df_fill

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  4.0  5.0  0.0  0.0
2  7.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

In [35]:
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [36]:
# to fill perticular values in perticular columns
df_fill = df.fillna({0: 10, 1: 20, 2: 30, 3: 40})
df_fill

      0     1     2     3
0   1.0   2.0   3.0  40.0
1   4.0   5.0  30.0  40.0
2   7.0  20.0  30.0  40.0
3  10.0  20.0  30.0  40.0

#### df.mean()
* gives the mean
* to fill the missing values by the mean values we use mean()

In [37]:
df

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [38]:
df.fillna(df.fillna(0).mean().to_dict())

     0     1     2    3
0  1.0  2.00  3.00  0.0
1  4.0  5.00  0.75  0.0
2  7.0  1.75  0.75  0.0
3  3.0  1.75  0.75  0.0

In [39]:
df_mean = df.fillna(df.mean())
df_mean

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  3.5  3.0 NaN
3  4.0  3.5  3.0 NaN

#### .replace(old_val,new_val)
* replaces the old values with new values
* values can be anything.

In [40]:
ser1 = pd.Series([1,2,100,4,5,100,7,8,100])
ser1

0      1
1      2
2    100
3      4
4      5
5    100
6      7
7      8
8    100
dtype: int64

In [41]:
# to replace 100 with 1
ser1.replace(100, 1)

0    1
1    2
2    1
3    4
4    5
5    1
6    7
7    8
8    1
dtype: int64

In [42]:
ser1

0      1
1      2
2    100
3      4
4      5
5    100
6      7
7      8
8    100
dtype: int64

In [43]:
# to replace multiple values with one single value
ser1.replace([1,2, 4], np.nan)

0      NaN
1      NaN
2    100.0
3      NaN
4      5.0
5    100.0
6      7.0
7      8.0
8    100.0
dtype: float64

In [44]:
ser1

0      1
1      2
2    100
3      4
4      5
5    100
6      7
7      8
8    100
dtype: int64

In [45]:
# replacing different values with some other different values
ser1.replace({100: np.nan, 1: 0.0})

0    0.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN
6    7.0
7    8.0
8    NaN
dtype: float64

#### get_dummies()
* it is one of the method to convert categorical variable to numerical variables

In [46]:
ser2 = pd.Series(list('abcdabcde'))
ser2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
8    e
dtype: object

In [47]:
pd.get_dummies(ser2)

   a  b  c  d  e
0  1  0  0  0  0
1  0  1  0  0  0
2  0  0  1  0  0
3  0  0  0  1  0
4  1  0  0  0  0
5  0  1  0  0  0
6  0  0  1  0  0
7  0  0  0  1  0
8  0  0  0  0  1

In [48]:
df = pd.read_csv('marks.csv')

In [49]:
df

  Name  Physics  Chemistry  Maths  Biology
0    A       65         69     87       90
1    B       44         76     57       80
2    C       57         85     79       75
3    D       54         66     71       70
4    E       74         86     75       88
5    F       64         67     77       81